let drukhariDict = {
  "a": ["𓆉", "𓇪", "𓁆", "𓅱", "𓍭", "𓍧", "𓌥", "𓀟", "𓆎", "𓊗", "𓄳", "𓀒", "𓍚", "𓋺", "𓂚", "𓀬", "𓆏", "𓀝"],
  "b": ["𓄾", "𓁖", "𓏒", "𓇂", "𓂁", "𓐔", "𓅊", "𓋾", "𓎋", "𓉴", "𓌑", "𓅤", "𓇚", "𓂫", "𓆍", "𓀺", "𓌄", "𓂄"],
  "c": ["𓃐", "𓌣", "𓍯", "𓉷", "𓉳", "𓈃", "𓁎", "𓋚", "𓀜", "𓂹", "𓍎", "𓌂", "𓇤", "𓆞", "𓇲", "𓆺", "𓄚", "𓄻"],
  "d": ["𓆇", "𓅽", "𓂅", "𓅋", "𓋣", "𓈭", "𓎍", "𓁥", "𓄱", "𓎸", "𓇯", "𓃺", "𓇀", "𓀢", "𓃌", "𓂾", "𓇋", "𓈎"],
  "e": ["𓋍", "𓐉", "𓋲", "𓅃", "𓅞", "𓄐", "𓂨", "𓋬", "𓏫", "𓐇", "𓐒", "𓂜", "𓉙", "𓅷", "𓌚", "𓋙", "𓎣", "𓀀"],
  "f": ["𓊦", "𓊬", "𓋊", "𓎢", "𓉿", "𓀸", "𓃇", "𓉏", "𓈀", "𓍦", "𓃴", "𓏐", "𓊄", "𓏊", "𓊂", "𓋎", "𓏖", "𓉢"],
  "g": ["𓂪", "𓁺", "𓍃", "𓋽", "𓍀", "𓋇", "𓁄", "𓁮", "𓃁", "𓎤", "𓏢", "𓎳", "𓊾", "𓋀", "𓆋", "𓁳", "𓊆", "𓊌"],
  "h": ["𓂢", "𓅕", "𓋛", "𓍤", "𓎷", "𓌡", "𓄧", "𓁾", "𓐏", "𓊈", "𓏧", "𓎕", "𓋹", "𓈩", "𓅀", "𓇖", "𓈪", "𓁠"],
  "i": ["𓂮", "𓊊", "𓋢", "𓊒", "𓅢", "𓇄", "𓏍", "𓃖", "𓌞", "𓀄", "𓅴", "𓃮", "𓏨", "𓄴", "𓂇", "𓄖", "𓊳", "𓊟"],
  "j": ["𓃚", "𓄼", "𓍝", "𓄕", "𓍄", "𓅾", "𓐄", "𓏀", "𓄹", "𓁔", "𓆵", "𓆆", "𓅳", "𓎼", "𓐎", "𓇅", "𓂕", "𓀚"],
  "k": ["𓏥", "𓊨", "𓎀", "𓅭", "𓈁", "𓃪", "𓇙", "𓃂", "𓍺", "𓇕", "𓏹", "𓈉", "𓁩", "𓂂", "𓀂", "𓁷", "𓈠", "𓅶"],
  "l": ["𓈲", "𓌶", "𓇊", "𓆓", "𓋫", "𓀨", "𓋐", "𓊥", "𓀪", "𓃨", "𓎌", "𓇎", "𓎝", "𓈟", "𓂺", "𓈻", "𓆘", "𓌆"],
  "m": ["𓌫", "𓄋", "𓉊", "𓊽", "𓃰", "𓏽", "𓌵", "𓐤", "𓎅", "𓎐", "𓊮", "𓂧", "𓄯", "𓃫", "𓁧", "𓉝", "𓈝", "𓇴"],
  "n": ["𓐌", "𓍨", "𓂠", "𓊕", "𓋘", "𓄲", "𓁏", "𓊀", "𓄬", "𓃜", "𓉂", "𓍵", "𓎱", "𓇶", "𓄢", "𓁱", "𓏜", "𓊿"],
  "o": ["𓅦", "𓈔", "𓅉", "𓍛", "𓃄", "𓇐", "𓈚", "𓀋", "𓀿", "𓅔", "𓎆", "𓈓", "𓎴", "𓅇", "𓇿", "𓌔", "𓄡", "𓋩"],
  "p": ["𓐅", "𓃔", "𓊵", "𓎾", "𓂤", "𓂼", "𓏼", "𓇦", "𓀧", "𓎓", "𓀑", "𓏩", "𓊸", "𓎶", "𓍟", "𓏝", "𓉖", "𓀕"],
  "q": ["𓂴", "𓆢", "𓀛", "𓆷", "𓇹", "𓃅", "𓎛", "𓂲", "𓆄", "𓉩", "𓍌", "𓍆", "𓂌", "𓈦", "𓐆", "𓋖", "𓁭", "𓋳"],
  "r": ["𓁿", "𓐧", "𓁸", "𓆐", "𓍼", "𓀎", "𓈾", "𓈵", "𓂳", "𓀾", "𓊙", "𓊲", "𓎑", "𓊁", "𓋝", "𓍾", "𓐖", "𓏅"],
  "s": ["𓍻", "𓁣", "𓏰", "𓏃", "𓏦", "𓈺", "𓃀", "𓄞", "𓍍", "𓂩", "𓆸", "𓀩", "𓐨", "𓇩", "𓌒", "𓃞", "𓌦", "𓌳"],
  "t": ["𓋕", "𓋰", "𓅟", "𓁵", "𓆰", "𓊇", "𓀌", "𓇔", "𓈞", "𓋪", "𓉶", "𓇢", "𓇜", "𓈘", "𓃋", "𓅜", "𓏕", "𓋿"],
  "u": ["𓅎", "𓃥", "𓅒", "𓌢", "𓅲", "𓐈", "𓐣", "𓈙", "𓌺", "𓋆", "𓂶", "𓅝", "𓀓", "𓏺", "𓍉", "𓄘", "𓆒", "𓍽"],
  "v": ["𓉞", "𓉺", "𓋷", "𓂛", "𓉟", "𓆛", "𓈖", "𓄶", "𓈏", "𓏵", "𓍢", "𓂵", "𓋔", "𓂯", "𓀊", "𓌙", "𓄭", "𓊢"],
  "w": ["𓇃", "𓉜", "𓄉", "𓉌", "𓄏", "𓏶", "𓎦", "𓉸", "𓁨", "𓋁", "𓇸", "𓅼", "𓐃", "𓇱", "𓋸", "𓄵", "𓊤", "𓌎"],
  "x": ["𓁓", "𓈊", "𓅓", "𓃻", "𓃼", "𓊭", "𓃛", "𓀭", "𓃩", "𓀍", "𓀹", "𓊪", "𓂘", "𓁁", "𓅠", "𓉫", "𓁼", "𓎚"],
  "y": ["𓊉", "𓀙", "𓏑", "𓉋", "𓌐", "𓆊", "𓃤", "𓁴", "𓂡", "𓅬", "𓄁", "𓊋", "𓄜", "𓊱", "𓉯", "𓍋", "𓆁", "𓋦"],
  "z": ["𓂿", "𓈇", "𓁫", "𓄒", "𓂃", "𓐑", "𓂟", "𓁲", "𓆀", "𓐊", "𓈨", "𓃑", "𓃃", "𓅹", "𓏟", "𓅻", "𓆤", "𓂍"],
  "а": ["𓊴", "𓐞", "𓂆", "𓁽", "𓃱", "𓈆", "𓉛", "𓃽", "𓀤", "𓈿", "𓀃", "𓎠", "𓃢", "𓄛", "𓎧", "𓂬", "𓋞", "𓏤"],
  "б": ["𓄗", "𓊔", "𓁒", "𓁤", "𓀳", "𓋠", "𓈽", "𓌖", "𓁘", "𓅐", "𓎄", "𓇍", "𓈧", "𓄪", "𓆹", "𓍗", "𓅺", "𓁛"],
  "в": ["𓁊", "𓎊", "𓎖", "𓇬", "𓇆", "𓈷", "𓌝", "𓆙", "𓊣", "𓂀", "𓐬", "𓁢", "𓏾", "𓄮", "𓄇", "𓉆", "𓏴", "𓂉"],
  "г": ["𓐪", "𓍮", "𓆔", "𓌏", "𓇓", "𓉑", "𓃶", "𓏯", "𓅄", "𓌌", "𓄄", "𓍠", "𓅚", "𓌩", "𓃸", "𓅨", "𓍅", "𓏞"],
  "д": ["𓅂", "𓇞", "𓎙", "𓎟", "𓅩", "𓈌", "𓎪", "𓇵", "𓁑", "𓋄", "𓋟", "𓅡", "𓁝", "𓍴", "𓁃", "𓇨", "𓏿", "𓍰"],
  "е": ["𓈍", "𓇠", "𓎮", "𓇧", "𓈯", "𓇝", "𓂐", "𓊐", "𓍊", "𓏪", "𓃡", "𓎬", "𓉗", "𓅏", "𓉈", "𓆨", "𓆝", "𓅧"],
  "ё": ["𓏬", "𓉇", "𓃗", "𓄔", "𓍹", "𓄂", "𓉤", "𓂎", "𓏌", "𓁜", "𓏘", "𓈼", "𓎩", "𓆡", "𓃈", "𓏇", "𓋃", "𓎎"],
  "ж": ["𓁗", "𓆂", "𓄺", "𓋡", "𓐥", "𓀖", "𓅵", "𓃘", "𓊅", "𓌕", "𓃲", "𓁋", "𓏚", "𓏭", "𓍁", "𓈤", "𓋒", "𓌷"],
  "з": ["𓅿", "𓀣", "𓀆", "𓋼", "𓅍", "𓏂", "𓌨", "𓀔", "𓊎", "𓍬", "𓁶", "𓃾", "𓐦", "𓏣", "𓍥", "𓅣", "𓆦", "𓉥"],
  "и": ["𓉬", "𓎰", "𓍙", "𓎗", "𓌜", "𓀽", "𓄟", "𓄫", "𓇾", "𓉱", "𓊘", "𓍘", "𓊶", "𓉵", "𓈶", "𓎃", "𓏈", "𓈳"],
  "й": ["𓆮", "𓉣", "𓊚", "𓈐", "𓃆", "𓁟", "𓌁", "𓌓", "𓁚", "𓐕", "𓏁", "𓆬", "𓁰", "𓉡", "𓅗", "𓍩", "𓃿", "𓄸"],
  "к": ["𓆶", "𓇽", "𓌉", "𓇏", "𓆫", "𓃎", "𓐫", "𓄓", "𓆱", "𓀡", "𓈸", "𓉁", "𓆧", "𓎡", "𓐭", "𓈮", "𓆟", "𓋗"],
  "л": ["𓌸", "𓇑", "𓌻", "𓁙", "𓏉", "𓌮", "𓀇", "𓀻", "𓐝", "𓉽", "𓉻", "𓌹", "𓂞", "𓇰", "𓉒", "𓇡", "𓊜", "𓆻"],
  "м": ["𓌧", "𓎥", "𓇺", "𓀵", "𓆿", "𓁉", "𓈈", "𓅰", "𓆽", "𓐚", "𓐩", "𓃝", "𓐜", "𓄙", "𓊯", "𓐘", "𓀲", "𓁞"],
  "н": ["𓎫", "𓎞", "𓐟", "𓉮", "𓉅", "𓇒", "𓆴", "𓁀", "𓄥", "𓆌", "𓂔", "𓆳", "𓆅", "𓍱", "𓉃", "𓈜", "𓆭", "𓌅"],
  "о": ["𓏲", "𓏆", "𓁻", "𓇳", "𓋧", "𓂏", "𓅆", "𓃕", "𓎘", "𓎭", "𓊃", "𓆯", "𓈑", "𓄿", "𓂣", "𓉠", "𓍪", "𓌗"],
  "п": ["𓍖", "𓊏", "𓈱", "𓁇", "𓃟", "𓊡", "𓅸", "𓌛", "𓌴", "𓉨", "𓎜", "𓁕", "𓂋", "𓅁", "𓌽", "𓎺", "𓅑", "𓄈"],
  "р": ["𓀼", "𓃉", "𓋂", "𓎇", "𓉕", "𓅫", "𓁅", "𓀉", "𓍸", "𓃷", "𓌋", "𓀯", "𓊷", "𓆗", "𓈕", "𓅈", "𓄷", "𓊺"],
  "с": ["𓍡", "𓐠", "𓁪", "𓇉", "𓉀", "𓄆", "𓍷", "𓂷", "𓋯", "𓈴", "𓃳", "𓃭", "𓄌", "𓈅", "𓄤", "𓎯", "𓁯", "𓐂"],
  "т": ["𓇼", "𓍕", "𓈄", "𓂥", "𓌘", "𓃵", "𓐙", "𓋮", "𓍔", "𓅌", "𓊫", "𓍓", "𓎂", "𓂻", "𓇛", "𓃊", "𓎔", "𓀷"],
  "у": ["𓈹", "𓇣", "𓄑", "𓐮", "𓃍", "𓌪", "𓌲", "𓉹", "𓂱", "𓂙", "𓐀", "𓅘", "𓊹", "𓎏", "𓇮", "𓋨", "𓌤", "𓐋"],
  "ф": ["𓈗", "𓎵", "𓏏", "𓈬", "𓂽", "𓉭", "𓊩", "𓎈", "𓌭", "𓐐", "𓊓", "𓆃", "𓏋", "𓎲", "𓂒", "𓍶", "𓃦", "𓏡"],
  "х": ["𓇁", "𓋉", "𓏳", "𓅖", "𓀏", "𓀦", "𓋴", "𓈣", "𓋏", "𓃹", "𓇌", "𓍐", "𓉚", "𓃙", "𓄃", "𓐗", "𓃏", "𓏻"],
  "ц": ["𓏮", "𓆈", "𓀠", "𓆕", "𓄎", "𓌃", "𓇫", "𓌱", "𓊼", "𓉄", "𓊞", "𓐁", "𓁬", "𓍳", "𓅥", "𓍣", "𓇭", "𓂈"],
  "ч": ["𓎹", "𓌊", "𓆜", "𓀅", "𓁐", "𓅪", "𓀶", "𓅮", "𓉘", "𓍜", "𓆪", "𓏗", "𓂗", "𓍏", "𓄰", "𓂝", "𓊰", "𓋻"],
  "ш": ["𓏔", "𓆠", "𓆚", "𓐢", "𓁂", "𓃧", "𓊛", "𓏄", "𓎒", "𓅯", "𓁡", "𓌈", "𓂊", "𓃒", "𓆥", "𓈒", "𓄝", "𓌀"],
  "щ": ["𓀈", "𓄦", "𓆩", "𓌯", "𓌇", "𓍇", "𓈡", "𓉐", "𓍑", "𓏙", "𓀗", "𓆲", "𓎻", "𓌾", "𓀐", "𓈥", "𓄣", "𓐓"],
  "ъ": ["𓄩", "𓀰", "𓈛", "𓈫", "𓅙", "𓀥", "𓆾", "𓇥", "𓐍", "𓎿", "𓋓", "𓄽", "𓉼", "𓀁", "𓁦", "𓂰", "𓋑", "𓉪"],
  "ы": ["𓉎", "𓁹", "𓀘", "𓂭", "𓉔", "𓉲", "𓁈", "𓅅", "𓃣", "𓎉", "𓍂", "𓄅", "𓀴", "𓏱", "𓋤", "𓄀", "𓇇", "𓏸"],
  "ь": ["𓏠", "𓌟", "𓎨", "𓈰", "𓏛", "𓊍", "𓏷", "𓏎", "𓋭", "𓀮", "𓉓", "𓁍", "𓄊", "𓉉", "𓆼", "𓊑", "𓂑", "𓍈"],
  "э": ["𓇈", "𓋶", "𓊠", "𓌰", "𓂖", "𓆑", "𓃓", "𓄠", "𓍞", "𓆖", "𓎽", "𓊻", "𓁌", "𓋌", "𓋅", "𓄍", "𓃠", "𓉧"],
  "ю": ["𓊖", "𓉰", "𓆣", "𓄨", "𓍒", "𓌬", "𓌼", "𓋵", "𓋱", "𓏓", "𓈢", "𓇘", "𓂦", "𓅛", "𓉦", "𓀫", "𓋈", "𓉍"],
  "я": ["𓈂", "𓀱", "𓊝", "𓈋", "𓂓", "𓋋", "𓐛", "𓋥", "𓌍", "𓋜", "𓉾", "𓃯", "𓀞", "𓇷", "𓍲", "𓇟", "𓎁", "𓐡"]
};

function gothicToDrukhari(inputStr) {
    inputStr = inputStr.toLowerCase();
    let inputChars = [...inputStr];
    let outputStr = '';
    for (let i = 0; i < inputChars.length; i++) {
        let gothicChar = inputChars[i];
        if (drukhariDict[gothicChar] !== undefined) {
            outputStr += drukhariDict[gothicChar][Math.floor(Math.random() * drukhariDict[gothicChar].length)];
        } else {
            outputStr += gothicChar;
        }
    }
    return outputStr;
}

function drukhariToGothic(inputStr) {
    inputStr = inputStr.toLowerCase();
    let inputChars = [...inputStr];
    let outputStr = '';
    for (let i = 0; i < inputChars.length; i++) {
        let characterIsFound = false;
        let drukhariChar = inputChars[i];
        for (let key in drukhariDict) {
            if (drukhariDict[key].includes(drukhariChar)) {
                outputStr += key;
                characterIsFound = true;
                break;
            }
        }
        if (!characterIsFound) {
            outputStr += drukhariChar;
        }
    }
    return outputStr;
}

function translateToDrukhari() {
    let input = document.getElementById('gothicInput').value;
    let outputText = gothicToDrukhari(input);
    outputText = outputText.replace(/\n/g, '<br>');
    let output = document.getElementById('drukhariOutput');
    output.innerHTML = outputText;
}

function translateToGothic() {
    let input = document.getElementById('drukhariInput').value;
    let outputText = drukhariToGothic(input);
    outputText = outputText.replace(/\n/g, '<br>');
    let output = document.getElementById('gothicOutput');
    output.innerHTML = outputText;
}
